tap "coursier/formulas"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/command-not-found"
tap "homebrew/core"
brew "sqlite"
brew "libx11"
brew "icu4c@76"
brew "harfbuzz"
brew "apache-arrow"
brew "bat"
brew "boost"
brew "btop"
brew "chezmoi"
brew "cmake"
brew "coreutils"
brew "curl"
brew "dasel"
brew "dprint"
brew "dust"
brew "exercism"
brew "eza"
brew "fastmod"
brew "faust"
brew "fd"
brew "fzf"
brew "gcc"
brew "gh"
brew "git"
brew "git-delta"
brew "git-filter-repo"
brew "go"
brew "pkgconf"
brew "graphviz"
brew "hadolint"
brew "htop"
brew "jq"
brew "lapack"
brew "libomp", link: true
brew "lsd"
brew "mame"
brew "mas"
brew "megatools"
brew "meson"
brew "ncdu"
brew "nicotine-plus"
brew "node"
brew "openblas"
brew "openjdk@11"
brew "pandoc"
brew "parquet-cli"
brew "pdftk-java"
brew "pipx"
brew "pixi"
brew "python-argcomplete"
brew "ripgrep"
brew "rom-tools"
brew "shellcheck"
brew "shfmt"
brew "tldr"
brew "wget"
brew "zenith"
brew "zoxide"
brew "zsh-completions"
brew "coursier/formulas/coursier"
cask "1password-cli"
cask "brave-browser"
cask "dash"
cask "discord"
cask "docker"
cask "dropbox"
cask "firefox"
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"
cask "font-latin-modern"
cask "gimp"
cask "google-chrome"
cask "gpg-suite-no-mail"
cask "hammerspoon"
cask "iterm2"
cask "keymapp"
cask "logitune"
cask "mactex"
cask "mullvadvpn"
cask "musescore"
cask "obsidian"
cask "openemu"
cask "protege"
cask "qbittorrent"
cask "rectangle"
cask "spotify"
cask "sublime-text"
cask "supercollider"
cask "the-unarchiver"
cask "visual-studio-code"
cask "vlc"
cask "zotero"
mas "24 Hour Wallpaper", id: 1226087575
mas "GarageBand", id: 682658836
mas "HP Smart", id: 1474276998
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
vscode "casualjim.gotemplate"
vscode "charliermarsh.ruff"
vscode "codeium.codeium"
vscode "cschlosser.doxdocgen"
vscode "deerawan.vscode-dash"
vscode "donjayamanne.githistory"
vscode "editorconfig.editorconfig"
vscode "github.vscode-github-actions"
vscode "golang.go"
vscode "james-yu.latex-workshop"
vscode "jeff-hykin.better-cpp-syntax"
vscode "mkhl.shfmt"
vscode "ms-python.debugpy"
vscode "ms-python.mypy-type-checker"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.makefile-tools"
vscode "njpwerner.autodocstring"
vscode "piotrpalarz.vscode-gitignore-generator"
vscode "redhat.vscode-yaml"
vscode "rust-lang.rust-analyzer"
vscode "samuelcolvin.jinjahtml"
vscode "scala-lang.scala"
vscode "scalameta.metals"
vscode "sumneko.lua"
vscode "sysoev.vscode-open-in-github"
vscode "tamasfe.even-better-toml"
vscode "timonwong.shellcheck"
vscode "twxs.cmake"
vscode "virgilsisoe.hammerspoon"
vscode "vivaxy.vscode-conventional-commits"
vscode "waderyan.gitblame"
